Feedback System Code in Rails/app/controllers/surveys_controller.rb

  def index
    # Code for listing all surveys goes here.
    @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

  def create
    # Code for creating a new survey goes here.
    @survey = Survey.new(survey_params)
    if @survey.save
---
INSERT INTO "surveys" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pet Feedback"], ["created_at", "2020-05-16 18:03:00.567635"], ["updated_at", "2020-05-16 18:03:00.567635"]]

  def show
    # Code for showing a single survey goes here.
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    # Code for updating an survey goes here.
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]