Feedback System Code in Rails/app/controllers/admin/surveys_controller.rb

  def index
    # Code for listing all surveys goes here.
    @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

  def edit
    # Code for edit survey form goes here.
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    # Code for showing a single survey goes here.
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    # Code for deleting an survey goes here.
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "surveys" WHERE "surveys"."id" = $1  [["id", 1]]